## Department Highest Salary Leetcode Task12

In [3]:
import pandas as pd
import numpy as np

In [11]:
data = [[1, 'Joe', 70000, 1], [2, 'Jim', 90000, 1], [3, 'Henry', 80000, 2], [4, 'Sam', 60000, 2], [5, 'Max', 90000, 1]]
Employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
Department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [12]:
Employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [13]:
Department

   id   name
0   1     IT
1   2  Sales

In [28]:
result = pd.merge(Employee, Department, left_on='departmentId', right_on='id', how='inner')
result = result.drop(columns=['departmentId','id_y','id_x'])
result

  name_x  salary name_y
0    Joe   70000     IT
1    Jim   90000     IT
2    Max   90000     IT
3  Henry   80000  Sales
4    Sam   60000  Sales

In [31]:
new_column_names = {'name_x': 'Employee', 'salary': 'Salary' , 'name_y':'Department'}
result= result.rename(columns=new_column_names)
result

  Employee  Salary Department
0      Joe   70000         IT
1      Jim   90000         IT
2      Max   90000         IT
3    Henry   80000      Sales
4      Sam   60000      Sales

In [34]:
highest_salary_rows = result.groupby('Department', as_index=False)['Salary'].max()
result = pd.merge(result, highest_salary_rows, on=['Department', 'Salary'])
result

  Employee  Salary Department
0      Jim   90000         IT
1      Max   90000         IT
2    Henry   80000      Sales